# Lesson 0 Notes

##### Table of Contents

### Python

Python is an interpreted language

* expressions
* variables
     - naming variables
    - reserved words
* data types
* basic output

In [24]:
# Hello World Program
print("Hello World")

Hello World

___________
We can use Python as a calculator.<br>
Addition

In [41]:
1 + 2

3

Multiplication using * for x

In [37]:
5 * 3

15

String multiplication

In [22]:
"Hello " * 3 + "Howard"

'Hello Hello Hello Howard'

Normal Divison using / for รท

In [38]:
5 / 2

2.5

Integer Division uses double slash //

In [39]:
5 // 2

2

All of these are expressions. We can save the results of these expressions into variables. These have some rules: [Excerpt from Think Python 2.2  Variable names](https://greenteapress.com/thinkpython2/html/thinkpython2003.html#sec17)

Below is an assignment statement.

In [14]:
percentage = (30/35) * 100

Here is some text, commonly known as strings. It can be enclosed in both double quotes or both single quotes

In [12]:
person = "Clarissa"
another_person = 'Howard'

But I want to write a sentence that has double quotes in it? You can escape the character with a backslash \

In [13]:
sentence = "Clarissa says \"Hi\". Clarissa's computer runs Windows 10 plus WSL with Ubuntu."
print(sentence)

Clarissa says "Hi". Clarissa's computer runs Windows 10 plus WSL with Ubuntu

This is some more complicated code, I want to put some remarks in for later using # to create a comment

In [6]:
# print puts stuff on the screen.
# You can print multiple things at once, separated by commas
print(person, "received", percentage, "% for a test")

Clarissa received 85.71428571428571 % for a test

In [55]:
# I don't want to see lots of trailing decimal places plus a space between decimal and %
# Let's utilise f-strings
# We can put f in front of double quotes and enclose variable names in braces {}
print(f"{person} received {percentage:.2f}% for a test")
# What if we want to print a brace, we double the brace
print(f"{{}}")

Clarissa received 85.71% for a test
{}

Clarissa decided to write a chapter in Python - not a smart idea; but she did it in triple double quoted strings which can go over lines

In [17]:
chapter = """This is a sentence.

This is another sentence.

Obviously this is another boring sentence.

Mandatory Monty Python reference - Spam; Spam; Spam"""
print(chapter)

This is a sentence.

This is another sentence.

Obviously this is another boring sentence.

Mandatory Monty Python reference - Spam; Spam; Spam

#### Clarissa just felt like shouting her stupid chapter

In [20]:
print(chapter.upper())

THIS IS A SENTENCE.

THIS IS ANOTHER SENTENCE.

OBVIOUSLY THIS IS ANOTHER BORING SENTENCE.

MANDATORY MONTY PYTHON REFERENCE - SPAM; SPAM; SPAM

In [25]:
name = input("Name:")
colour = input("Colour:")

Name: Clarissa
Colour: Pink

In [51]:
print(name)

Apple

**Let's write a function so we can reuse code.**

We use the def keyword and use brackets with optional arguments ending with a colon.
We must indent our code by a tab or 4 spaces otherwise the interpreter will complain.

If you think this is annoying - other languages such as Java and C uses braces and this can be put inconsistently depending on the style

Python forces you into good habits re reading code

In [28]:
def favourite_colour(name, colour):
    print(f"{name}'s favourite colour is {colour}")
    
favourite_colour(name, colour)

Clarissa's favourite colour is Pink

In [30]:
def get_favourite_colour():
    name = input("Name:")
    colour = input("Favourite Colour:")
    print(f"{name}'s favourite colour is {colour}")
get_favourite_colour()

Name: Aaron
Colour: Blue

Aaron's favourite colour is Blue

We want to display a message praising people who like pink. We can use an if.. else statement. With an if else statement

In [41]:
def get_favourite_colour_judgement(name = None, colour = None):
    if name is None and colour is None:
        name = input("Name:")
        colour = input("Colour:")
    print(f"{name}'s Favourite colour is {colour}")
    if colour.lower() == "pink":
        print("You have excellent taste in colour")
    else:
        print("Ho hum.")
    return (name, colour)
colour_info = get_favourite_colour_judgement()

Name: A
Colour: Blue

A's Favourite colour is Blue
Ho hum.

You can store a list of items in a data type called a List which is mutable (can be changed) Similar to lists but immutable are tuples

In [ ]:
a_empty_list = []
a_empty_tuple = (,)
a_empty_string = ""

Let's print all the numbers from 1 to 100. We can use the range function `range(n, m)` where `n` is included and `m` is not

In [47]:
print(list(range(0,5)))

[0, 1, 2, 3, 4]

In [48]:
for i in range(1, 101):
    print(i, end=" ")

1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100

Let's get the even numbers, there is an additional argument - step.

In [50]:
for i in range(2, 101,2):
    print(i, end=" ")

2 4 6 8 10 12 14 16 18 20 22 24 26 28 30 32 34 36 38 40 42 44 46 48 50 52 54 56 58 60 62 64 66 68 70 72 74 76 78 80 82 84 86 88 90 92 94 96 98 100

You have 5 people who you want to get details from about their favourite colours. We need to use a `for` loop to repeat the function.

In [40]:
colour_info_list = []
for i in range(5):
    colour_info_list.append(get_favourite_colour_judgement())
print(colour_info_list)

Name: A
Colour: Orange

A's favourite colour is Orange
Ho hum.

Name: B
Colour: Blue

B's favourite colour is Blue
Ho hum.

Name: D Lilac
Colour: C

D Lilac's favourite colour is C
Ho hum.

Name: Eliz
Colour: Pink

Eliz's favourite colour is Pink
You have excellent taste in colour

Name: H
Colour: Gray

H's favourite colour is Gray
Ho hum.
[('A', 'Orange'), ('B', 'Blue'), ('D Lilac', 'C'), ('Eliz', 'Pink'), ('H', 'Gray')]

</br>We want to get all the names from colour_info_list
How can we do this?

### SQL

**Overview**</br>
[Basic Query](#basic_query)</br>
[WHERE Clause](#where)</br>
[= (EQUALS)](#equal)</br>
[AND operator](#and)</br>
[<> (NOT EQUAL)](#not_equal)</br>

#### Setting up
We want to be able to view the tables available and the attributes of the tables. (Your tutor had investigated using freewha.com and the inbuilt MyPHPAdmin but the downside is you can't view the attributes when writing your queries)

This code loads a sql extension for jupyter. Also hides the connected database and other annoying error messages.

We are going to download the Chinook database from github using a command wget, commands which are executed via bash have a ! in front of them.
We are then going to load this database and connect to it.

Adding a sidebar to display useful database stuff.

For future reference if you have a link to another sqlite database you must **Change the url of DB_URL and name of DB_NAME.**

In [52]:
%reload_ext sql
%config SqlMagic.displaycon = False
%config SqlMagic.feedback = False
%config SqlMagic.autolimit = 100
%config SqlMagic.displaylimit = 15

import sys
sys.path.insert(0, './.hidden')
from ipylab import JupyterFrontEnd, Panel
from ipywidgets import Tab, Text, Output, HTML, HBox, VBox, Button, Layout,ButtonStyle
app = JupyterFrontEnd()

#DB_URL = "https://github.com/lerocha/chinook-database/blob/master/ChinookDatabase/DataSources/Chinook_Sqlite.sqlite?raw=true"
DB_NAME = "Testing"
DB_FILE = "Testing.db"

#!wget -q -O $DB_FILE $DB_URL
%sql sqlite:///$DB_FILE

#GET TABLE INFO

tablesList = !sqlite3 $DB_FILE .table
!sqlite3 $DB_FILE .table > .hidden/tables.txt
tables = [i for line in tablesList for i in line.split()]
tables.sort()
AllTables = " ".join([table for table in tables])

#RIGHT PANEL INFO

tblInfo = !./.hidden/Table_View.sh $DB_FILE $AllTables
tblAttr = !./.hidden/getAttributes.sh $DB_FILE $AllTables
ddl = !sqlite3 $DB_FILE .schema

from right_panel import display_right_panel
display_right_panel(app, tblInfo, tblAttr, ddl)

#ADD ER DIAGRAM
IMG_FILE = f"erd_{DB_NAME}.png"
!eralchemy -i sqlite:///$DB_FILE -o $IMG_FILE

from image_load import load_image
load_image(app, IMG_FILE)

To execute sql into this jupyter notebook, we must either make use of the `%sql` or `%%sql` magic command. `%sql` is for a single line and `%%sql` is for an entire cell.

Sample Table **employees**

| emp_no | birth_date | first_name | last_name | gender | hire_date |
|---------|------------|-----------|-----------|---------|----|
| 10001 | 1953-09-02 | Georgi | Facello | M | 1986-06-26 |

employees:            emp_no, birth_date, first_name, 
                      last_namegender, hire_date

<a id="basic_query">All basic Data Manipulation Language (DML) queries are of this basic structure.</a>

In [4]:
%%sql
SELECT first_name, last_name, birth_date
FROM employees
LIMIT 5

[('Georgi', 'Facello', '1953-09-02'),
 ('Bezalel', 'Simmel', '1964-06-02'),
 ('Parto', 'Bamford', '1959-12-03'),
 ('Chirstian', 'Koblick', '1954-05-01'),
 ('Kyoichi', 'Maliniak', '1955-01-21')]

We are feeling really lazy and as we want to get all the columns from the table we can use the `*` operator

In [5]:
%%sql
SELECT *
FROM employees
LIMIT 5

[(10001, '1953-09-02', 'Georgi', 'Facello', 'M', '1986-06-26'),
 (10002, '1964-06-02', 'Bezalel', 'Simmel', 'F', '1985-11-21'),
 (10003, '1959-12-03', 'Parto', 'Bamford', 'M', '1986-08-28'),
 (10004, '1954-05-01', 'Chirstian', 'Koblick', 'M', '1986-12-01'),
 (10005, '1955-01-21', 'Kyoichi', 'Maliniak', 'M', '1989-09-12')]

We just want to see people's first names.

When we choose a subset of columns using SQL, that is called Projection. This term comes from relational algebra.

In [6]:
%%sql
SELECT first_name
FROM employees
LIMIT 5

[('Georgi',), ('Bezalel',), ('Parto',), ('Chirstian',), ('Kyoichi',)]

<a id="where">Imagine you only want to find people with the first name Basil. Well in that case, let's introduce the `WHERE` clause</a>

When we choose a subset of rows using SQL, that is called Selection, this also comes from relational algebra. But Selection corresponds with `WHERE` **NOT** `SELECT`

<a id="equal">Because we want to find all people with a first name equal to 'Basil' we use equal sign `=`</a>

In [11]:
%%sql
SELECT first_name, last_name, birth_date
FROM employees
WHERE first_name = "Basil"
LIMIT 5

[('Basil', 'Tramer', '1961-04-24'),
 ('Basil', 'Ishibashi', '1955-12-12'),
 ('Basil', 'Erman', '1953-08-15'),
 ('Basil', 'Covnot', '1963-07-08'),
 ('Basil', 'Perez', '1952-07-21')]

<a id="and">You don't want to see any people named Perez in addition to people being named Basil so we link these together with `AND`</a>

<a id="not_equal"> Not equal is  `<>`</a

In [15]:
%%sql
SELECT first_name, last_name, birth_date
FROM employees
WHERE first_name = 'Basil' AND last_name<> 'Perez'
LIMIT 10

[('Basil', 'Tramer', '1961-04-24'),
 ('Basil', 'Ishibashi', '1955-12-12'),
 ('Basil', 'Erman', '1953-08-15'),
 ('Basil', 'Covnot', '1963-07-08'),
 ('Basil', 'Macedo', '1961-09-22'),
 ('Basil', 'Bonifati', '1963-02-27'),
 ('Basil', 'Welham', '1958-05-17'),
 ('Basil', 'Prampolini', '1960-05-22'),
 ('Basil', 'Yurek', '1959-06-26'),
 ('Basil', 'McFarlin', '1958-04-18')]

In [54]:
%%html
<style>
table {float:left}
</style>

Let's say we have another table named Cat_Ownership_Summary (which was derived from another table - see this later)

Table Cat_Ownership_Summary

|first_name | num_cats|
|---- | ----|
|Clarissa  | 2|

**cats.sql**
```
CREATE TABLE Cat_Ownership_Summary (
    first_name  VARCHAR(14)     PRIMARY KEY NOT NULL,
    num_cats INT NOT NULL
);

INSERT INTO Cat_Ownership_Summary (first_name, num_cats)
VALUES
('Clarissa',0),
('Elizabeth',5),
('Richard', 3),
('Phillip', 7),
('Emma', 2);
```
We need to create the actual database by loading this sql file into a new datebase called Cats.db

In [23]:
#CREATE A TABLE
!sqlite3 Cats2.db < cats.sql
%sql sqlite:///Cats2.db

In [24]:
%%sql
SELECT *
FROM Cat_Ownership_Summary

[('Clarissa', 0),
 ('Elizabeth', 5),
 ('Richard', 3),
 ('Phillip', 7),
 ('Emma', 2)]

We want to see the person's id and number of cats who own more than 2 cats. We can use the greater than sign, `>`

In [25]:
%%sql
SELECT first_name, num_cats
FROM Cat_Ownership_Summary
WHERE num_cats > 2;

[('Elizabeth', 5), ('Richard', 3), ('Phillip', 7)]

A strange person wants to see people who own no cats, 3 cats and 7 cats. We can use `IN` keyword

In [26]:
%%sql
SELECT first_name, num_cats
FROM Cat_Ownership_Summary
WHERE num_cats IN (0, 3, 7);

[('Clarissa', 0), ('Richard', 3), ('Phillip', 7)]

Someone believes that the right number of cats is between 3 and 5 inclusive. We can use the `BETWEEN` keyword

In [27]:
%%sql
SELECT first_name, num_cats
FROM Cat_Ownership_Summary
WHERE num_cats BETWEEN 3 AND 5;

[('Elizabeth', 5), ('Richard', 3)]

This could also be expressed less concisely as
```
SELECT first_name, num_cats
FROM Cat_Ownership_Summary
WHERE num_cats >= 3 AND num_cats <= 5;
```

A person named Zara created a 'Z' day on the 2nd February. They want to find all people with a given name starting with 'Z' so they can celebrate Z day together.
We can use the operator `LIKE` with the string operator `%` to represent 1 or more wildcard characters.

In [16]:
%%sql
SELECT first_name, last_name, birth_date
FROM employees
WHERE first_name LIKE "Z%"
LIMIT 10

[('Zvonko', 'Nyanchama', '1952-06-29'),
 ('Zhongwei', 'Rosen', '1960-12-17'),
 ('Zhonghui', 'Zyda', '1957-03-29'),
 ('Zissis', 'Pintelas', '1961-09-14'),
 ('Zhenbing', 'Perng', '1955-01-29'),
 ('Zdislav', 'Nastansky', '1959-04-08'),
 ('Zhenhua', 'Magalhaes', '1958-12-07'),
 ('Zsolt', 'Salinas', '1964-11-12'),
 ('Zhonghui', 'Preusig', '1956-09-21'),
 ('Zhiwei', 'Anick', '1957-03-13')]

We wish to order the results in the database by a particular attribute. We need to use the `ORDER BY` command. The default order is in ascending order but one can specify `ASC` or `DESC` for ascending or descending order respectively

In [33]:
%%sql
SELECT first_name, num_cats
FROM Cat_Ownership_Summary
WHERE num_cats > 2
ORDER BY num_cats DESC;

[('Phillip', 7), ('Elizabeth', 5), ('Richard', 3)]

In [34]:
%%sql
SELECT first_name, num_cats
FROM Cat_Ownership_Summary
WHERE num_cats > 2
ORDER BY first_name;

[('Elizabeth', 5), ('Phillip', 7), ('Richard', 3)]

Alternatively you can access the database using sqlite3 for a sqlite database and execute commands. For this to work; we get a instance of bash working + the commands to go into the sqlite executable. However this is not interactive unlike bash. The developer of the ipython-sql plugin did some work to make it output more prettily

In [10]:
%%bash
sqlite3 Chinook.db
.headers on
.mode markdown
SELECT * FROM Album
LIMIT 10;
.quit

| AlbumId |                 Title                 | ArtistId |
|---------|---------------------------------------|----------|
| 1       | For Those About To Rock We Salute You | 1        |
| 2       | Balls to the Wall                     | 2        |
| 3       | Restless and Wild                     | 2        |
| 4       | Let There Be Rock                     | 1        |
| 5       | Big Ones                              | 3        |
| 6       | Jagged Little Pill                    | 4        |
| 7       | Facelift                              | 5        |
| 8       | Warner 25 Anos                        | 6        |
| 9       | Plays Metallica By Four Cellos        | 7        |
| 10      | Audioslave                            | 8        |